{
    "plants": [
        {
            "name": "Aloe Vera",
            "description": "Суккулентное растение с мясистыми листьями, богатыми гелем, который используется для лечения ран, ожогов и ухода за кожей. Устойчиво к засухе и требует минимум ухода.",
            "id": "1"
        },
        {
            "name": "Areca Palm (Dypsis lutescens)",
            "description": "Тропическая пальма с длинными перистыми листьями. Отлично очищает воздух от токсинов и добавляет влагу в помещение. Требует яркого, но рассеянного света.",
            "id": "2"
        },
        {
            "name": "Begonia (Begonia spp.)",
            "description": "Декоративно-лиственное или цветущее растение с разнообразными формами и окрасками листьев. Предпочитает влажный воздух и защищённые от прямых солнечных лучей места.",
            "id": "3"
        },
        {
            "name": "Boston Fern (Nephrolepis exaltata)",
            "description": "Популярный папоротник с густыми зелёными листьями. Хорошо очищает воздух и повышает влажность. Любит тень и регулярный полив.",
            "id": "4"
        },
        {
            "name": "Calathea",
            "description": "Декоративно-лиственное растение с яркими узорами на листьях. Требует высокой влажности воздуха и защиты от прямого солнечного света.",
            "id": "5"
        },
        {
            "name": "Chrysanthemum",
            "description": "Цветущее растение с крупными соцветиями разных цветов. Известно своими фильтрующими свойствами и способностью улучшать качество воздуха.",
            "id": "6"
        },
        {
            "name": "Money Tree (Pachira aquatica)",
            "description": "Символическое растение, приносящее удачу и процветание. Имеет характерные пучки листьев и хорошо растёт как в почве, так и в воде.",
            "id": "7"
        },
        {
            "name": "Monstera Deliciosa (Monstera deliciosa)",
            "description": "Лиановидное растение с большими прорезными листьями. Идеально подходит для создания тропического интерьера. Требует опоры для роста.",
            "id": "8"
        },
        {
            "name": "Orchid",
            "description": "Разнообразное семейство растений с красивыми цветами. Орхидеи могут быть эпифитами или наземными растениями. Требуют специального ухода.",
            "id": "9"
        },
        {
            "name": "Rubber Plant (Ficus elastica)",
            "description": "Декоративно-лиственное растение с глянцевыми листьями. Хорошо адаптируется к комнатным условиям и помогает очищать воздух.",
            "id": "10"
        },
        {
            "name": "Schefflera",
            "description": "Многолетнее растение с пальчато-сложными листьями. Устойчиво к различным условиям и отлично украшает интерьер.",
            "id": "11"
        },
        {
            "name": "ZZ Plant (Zamioculcas zamiifolia)",
            "description": "Суккулентное растение с блестящими тёмно-зелёными листьями. Очень устойчиво к неблагоприятным условиям и требует минимального ухода.",
            "id": "12"
        }
    ]
}