{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Aloe Vera",
    "1": "Areca Palm (Dypsis lutescens)",
    "2": "Begonia (Begonia spp.)",
    "3": "Boston Fern (Nephrolepis exaltata)",
    "4": "Calathea",
    "5": "Chrysanthemum",
    "6": "Money Tree (Pachira aquatica)",
    "7": "Monstera Deliciosa (Monstera deliciosa)",
    "8": "Orchid",
    "9": "Rubber Plant (Ficus elastica)",
    "10": "Schefflera",
    "11": "ZZ Plant (Zamioculcas zamiifolia)"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Aloe Vera": 0,
    "Areca Palm (Dypsis lutescens)": 1,
    "Begonia (Begonia spp.)": 2,
    "Boston Fern (Nephrolepis exaltata)": 3,
    "Calathea": 4,
    "Chrysanthemum": 5,
    "Money Tree (Pachira aquatica)": 6,
    "Monstera Deliciosa (Monstera deliciosa)": 7,
    "Orchid": 8,
    "Rubber Plant (Ficus elastica)": 9,
    "Schefflera": 10,
    "ZZ Plant (Zamioculcas zamiifolia)": 11
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.3"
}
